n = int (input('Яку дію хочете зробити? \n 1 Додавання \n 2 Віднімання \n 3 Ділення \n 4 Множення \n '))

try:
    q1 = int (input('Введіть число 1: '))
except ValueError:
     print('Не вірний символ, перевірте правильність вводу')

try:
    q2 = int(input('Введіть число 2: '))
except ValueError:
    print('Не вірний символ, перевірте правильність вводу')


if n == 1:
    r = q1 + q2
    p = 'додавання'
    t = p
if n == 2:
    r = q1 - q2
    l = 'віднімання'
    t = l
if n == 3:
    r = float(q1 / q2)
    m = 'ділення'
    t = m
if n == 4:
    r = q1 * q2
    n = 'множення'
    t = n

print ('Результат ',t,' = ',r)

